In [111]:
import nltk
import pandas as pd
import numpy as np
import sys

data = pd.read_csv('entire_data_Mentioned.csv', header=0).iloc[:59993, 1:].drop_duplicates() ## because the first column are indexes
# data_4th = pd.read_csv('entire_data_Mentioned_4th.csv', header=0).iloc[:, 1:].drop_duplicates() ## because the first column are indexes

In [112]:
data

      detected_entity  brand_id  model_id  year  ybm_id    org_id
0                   3         0         3     0       0    3227.0
1                   3         0         3     0       0    5226.0
2                   3         0         3     0       0    5292.0
3              SERIES         0         3     0       0    5814.0
4                   3         0         3     0       0    6253.0
...               ...       ...       ...   ...     ...       ...
59988          SERIES         0       413     0       0  254919.0
59989          SERIES         0       413     0       0  255415.0
59990          SERIES         0       413     0       0  255740.0
59991          SERIES         0       413     0       0  281814.0
59992          SERIES         0       413     0       0  308800.0

[59993 rows x 6 columns]

In [161]:
ids = pd.read_csv('car_model_ids.csv', header=0)
match_unique_models = ids.drop_duplicates(subset = ['brand','model_fromsales'],keep='last')
match_unique_brands = ids.drop_duplicates(subset = ['brand'],keep='last')

In [ ]:
unique_models=[]
for x in ids.model_fromsales:
    if x not in unique_models:
         unique_models.append(x)

### every models itself (not including variations, such as half of the model name) is unique

In [167]:
print(len(unique_models))
print(len(match_unique_models))

416
416

In [150]:
print(unique_models)

['CL', 'MDX', 'NSX', 'RL', 'RSX', 'TL', 'A4', 'A6', 'TT', '3 SERIES', '5 SERIES', '7 SERIES', 'X5', 'Z3', 'Z8', 'CENTURY', 'LESABRE', 'REGAL', 'RENDEZVOUS', 'DEVILLE', 'ELDORADO', 'SEVILLE', 'ASTRO PASS', 'CAVALIER', 'CORVETTE', 'EXPRESS CARGO', 'EXPRESS PASS', 'IMPALA', 'MALIBU', 'MONTE CARLO', 'PRIZM', 'S BLAZER', 'S10 PICKUP', 'SILVERADO', 'TAHOE', 'TRACKER', 'TRAILBLAZER', 'VENTURE', '300 M', 'CONCORDE', 'PT CRUISER', 'SEBRING SEDAN', 'TOWN & COUNTRY', 'VOYAGER', 'LANOS', 'LEGANZA', 'NUBIRA', 'CARAVAN', 'DURANGO', 'INTREPID', 'NEON', 'STRATUS SEDAN', 'VIPER', 'CROWN VICTORIA', 'ECONOLINE', 'ESCAPE', 'ESCORT', 'EXPEDITION', 'EXPLORER', 'F SERIES', 'FOCUS', 'MUSTANG', 'TAURUS', 'THUNDERBIRD', 'WINDSTAR PASS', 'ENVOY', 'SAFARI PASS', 'SAVANA CARGO', 'SIERRA', 'SONOMA', 'YUKON', 'ACCORD', 'CIVIC', 'CR-V', 'INSIGHT', 'ODYSSEY', 'PASSPORT', 'S2000', 'ACCENT', 'ELANTRA', 'SANTA FE', 'SONATA', 'XG350', 'G20', 'I35', 'Q45', 'QX4', 'AXIOM', 'RODEO', 'TROOPER', 'S-TYPE', 'X-TYPE', 'XJ6/8', 'XJR', 'XK8', 'GRAND CHEROKEE', 'LIBERTY', 'WRANGLER', 'RIO', 'SEDONA', 'SPECTRA', 'SPORTAGE', 'DISCOVERY', 'RANGE ROVER', 'ES300', 'GS300', 'GS430/460', 'IS300', 'LS430/460', 'LX470', 'RX300', 'SC430', 'BLACKWOOD', 'CONTINENTAL', 'LS', 'NAVIGATOR', 'TOWN CAR', '626', 'MILLENIA', 'MPV PASS VAN', 'MX-5 MIATA', 'PROTEGE', 'TRIBUTE', 'C CLASS', 'CL CLASS', 'CLK CLASS', 'E CLASS', 'M CLASS', 'S CLASS', 'SL CLASS', 'SLK CLASS', 'COUGAR', 'GRAND MARQUIS', 'MOUNTAINEER', 'SABLE', 'VILLAGER', 'LANCER', 'MIRAGE', 'MONTERO SPORT', 'ALTIMA', 'FRONTIER', 'MAXIMA', 'QUEST', 'SENTRA', 'XTERRA', 'ALERO', 'BRAVADA', 'INTRIGUE', 'SILHOUETTE', 'AZTEK', 'BONNEVILLE', 'FIREBIRD', 'GRAND AM', 'GRAND PRIX', 'MONTANA', 'SUNFIRE', '911', 'BOXSTER', 'DAKOTA', 'RAM PICKUP', 'RAM WAGON', '9-3', '9-5', 'FORESTER', 'IMPREZA', 'LEGACY', 'OUTBACK', 'ESTEEM', 'VITARA', 'XL-7', '4RUNNER PASS', 'CAMRY', 'CELICA', 'COROLLA', 'HIGHLANDER', 'LAND CRUISER', 'MR2 SPYDER', 'PRIUS', 'SEQUOIA', 'SIENNA', 'TACOMA', 'TUNDRA', 'BEETLE II', 'CABRIOLET', 'EUROVAN', 'GOLF', 'JETTA', 'PASSAT', '40', '60', '70 C', '70 V', '80', 'Z4', 'PARK AVE', 'CTS', 'ESCALADE ESV', 'ESCALADE EXT', 'AVALANCHE', 'SUBURBAN', 'RANGER', 'SAVANA PASS', 'YUKON XL', 'ELEMENT', 'PILOT', 'TIBURON', 'FX', 'M35/45', 'ASCENDER', 'OPTIMA', 'SORENTO', 'FREELANDER', 'GX460/470', 'AVIATOR', 'MAZDA6', 'G CLASS', 'OUTLANDER', '350Z', 'MURANO', 'AURORA', 'VIBE', 'BAJA', 'AERIO', 'AVALON', 'ECHO', 'RAV4', 'XC70', 'XC90', 'TSX', 'X3', 'RAINIER', 'ESCALADE', 'SRX', 'XLR', 'AVEO', 'COLORADO', 'SSR', 'CROSSFIRE', 'PACIFICA', 'FREESTAR', 'QX56', 'ES330', 'RX330', 'B SERIES', 'MAZDA3', 'MONTEREY', 'ARMADA', 'GTO', 'CAYENNE', 'xA', 'xB', 'FORENZA', 'VERONA', 'MATRIX', 'PHAETON', 'TOUAREG', '6 SERIES', 'TERRAZA', 'STS', 'COBALT', 'UPLANDER', '300 SERIES', 'MAGNUM', 'STRATUS COUPE', 'FIVE HUNDRED', 'FREESTYLE', 'CANYON', 'TUCSON', 'AMANTI', 'LR3', 'RX-8', 'MARINER', 'MONTEGO', 'PATHFINDER', 'CARRERA GT', '9-2X', '50', 'A3', 'LACROSSE', 'LUCERNE', 'DTS', 'EQUINOX', 'HHR', 'CHARGER', 'FUSION', 'RIDGELINE', 'G35/37', 'i-SERIES', 'COMMANDER', 'IS250/350', 'RX400', 'MARK LT', 'MAZDA5', 'R CLASS', 'MILAN', 'RAIDER', 'TITAN', 'MONTANA SV6', 'SOLSTICE', 'TORRENT', 'CAYMAN', '9-7X', 'tC', 'TRIBECA', 'GTI', 'ASPEN', 'CALIBER', 'NITRO', 'EDGE', 'ACADIA', 'FIT', 'AZERA', 'ENTOURAGE', 'COMPASS', 'RANGE ROVER SPORT', 'ES350', 'GS350', 'GS450', 'RX350', 'MKZ', 'CX-7', 'GL CLASS', 'VERSA', 'G5', 'SKY', 'VUE', 'SX4', 'FJ CRUISER', 'EOS', 'RABBIT', 'RDX', 'ENCLAVE', 'AVENGER', 'CHALLENGER', 'TAURUS X', 'VERACRUZ', 'EX', 'PATRIOT', 'RONDO', 'LR2', 'LS600', 'MKX', 'CX-9', 'ROGUE', 'G6', 'G8', 'R32', '30', 'X6', 'TRAVERSE', 'JOURNEY', 'FLEX', 'H3', 'H3T', 'GENESIS', 'XF', 'BORREGO', 'MKS', '370Z', 'GT-R', 'EQUATOR', 'VENZA', 'YARIS', 'CC', 'ROUTAN', 'TIGUAN', 'ZDX', '1 SERIES', 'CAMARO', 'TRANSIT CONNECT', 'TERRAIN', 'CROSSTOUR', 'FORTE', 'SOUL', 'LR4', 'HS250', 'LX570', 'RX450', 'MKT', 'GLK CLASS', 'CUBE', 'PANAMERA', 'KIZASHI', 'XC60', '200 SERIES', 'FIESTA', 'CR-Z', 'EQUUS', 'CT200', 'MAZDA2', 'COOPER', 'COUNTRYMAN', 'OUTLANDER SPORT', 'JUKE', 'WRX', 'VERANO', 'CRUZE', 'VELOSTER', 'SLS CLASS', 'I', 'LEAF', 'ILX', 'X1', 'ENCORE', 'ATS', 'XTS', 'SONIC', 'SPARK', 'VOLT', 'DART', 'C-MAX', 'JX', 'FR-S', 'BRZ', 'XV CROSSTREK', 'PRIUS C']

In [169]:
## keep track of the True or False value of whether the detected_entity is a unique model name
tfVal = []
for i in range(len(data)):
    tfVal.append(data['detected_entity'][i] not in unique_models)

In [170]:
## the droped entities are the ones that are not a unique model name, such as "SERIES" and "CX"
dropped = data.loc[tfVal]

In [171]:
dropped

      detected_entity  brand_id  model_id  year  ybm_id    org_id
0                   3         0         3     0       0    3227.0
1                   3         0         3     0       0    5226.0
2                   3         0         3     0       0    5292.0
3              SERIES         0         3     0       0    5814.0
4                   3         0         3     0       0    6253.0
...               ...       ...       ...   ...     ...       ...
59988          SERIES         0       413     0       0  254919.0
59989          SERIES         0       413     0       0  255415.0
59990          SERIES         0       413     0       0  255740.0
59991          SERIES         0       413     0       0  281814.0
59992          SERIES         0       413     0       0  308800.0

[18751 rows x 6 columns]

In [172]:
len(dropped)

18751

In [173]:
dropped.to_csv('dropped_detections')